# Remove Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..Remove Method
ExportPatternTable Class See Also
---
Removes the pair (key, info) by pattern key.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Remove(
	ExportPatternKey exportPatternKey
)
```

Visual Basic
---
```text
Public Sub Remove ( _
	exportPatternKey As ExportPatternKey _
)
```

Visual C++
---
```text
public:
void Remove(
	ExportPatternKey^ exportPatternKey
)
```

# ### Parameters
exportPatternKey
    Type: Autodesk.Revit.DB..::..ExportPatternKey The export pattern key.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace